<a href="https://colab.research.google.com/github/zwarshavsky/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/Zhenya_Warshavsky_LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-09 19:22:20--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.1.115
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.1.115|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  33.3MB/s    in 6.3s

2019-09-09 19:22:27 (31.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [205]:
# import pandas as pd
# import numpy as np
# import matplotlib.pyplot as plt
# import os

# #how can this function take multiple dataframes!!! HINT: needs a list :) Write later
# def h(dataframe,*args):
#     return display(dataframe.head(*args))

# # function for loading csv into pandas and definining the output dataframe by the file handle
# def csv(handle):
#     file = handle
#     handle = handle.strip(".csv")
#     globals()[handle] = pd.read_csv(file)

# # function to take a list of csv_files in a directory and apply the csv(handle) function to each file
# def csv_list(c_list):
#     for file in c_list:
#         csv(file)


#function to create list containing all files types indicated in the current directory 
# def make_f_list(filetype):
#     c_list = []
#     for root, dirs, files in os.walk(os.getcwd()):
#         for file in files:
#             if file.endswith(filetype):
#                 asps.append(file)
#     return c_list

# make_f_list(".csv")

[]

In [32]:
#aisles isn't useful for my purposes

aisles = pd.read_csv("aisles.csv")

h(aisles)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [34]:
#this df is not useful 

departments = pd.read_csv("departments.csv")

h(departments)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [51]:
#this df is useful 

order_products_prior = pd.read_csv("order_products__prior.csv")

h(order_products_prior)
order_products_prior.shape

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

(32434489, 4)

In [62]:
#this df is also useful, but has to be concatenated with the other order_products list for the full order list

order_products_train = pd.read_csv("order_products__train.csv")

h(order_products_train)
order_products__train.shape

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

(1384617, 4)

In [57]:
#this is not useful 

orders = pd.read_csv("orders.csv")

h(orders)
orders.shape

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

(3421083, 7)

In [58]:
#this is definitely useful. we have to add product_name column to the concatenated orders df's in order to perform a value count of the most popular items  

products = pd.read_csv("products.csv")

h(products)
products.shape

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

(49688, 4)

In [59]:
h(order_products__train)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [70]:
#concatenate the two order lists

order_products = pd.concat([order_products_prior,order_products_train])
h(order_products)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
#confirms that the concatenation was a success 

assert (order_products_prior.shape[0] + order_products_train.shape[0]) == order_products.shape[0]

In [83]:
#remove unwanted columns

columns = ["order_id","product_id"]

order_products2 = order_products[columns]
h(order_products2)

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [84]:
h(products)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [85]:
#remove columns I don't need before the merge

columns_products = [
           'product_id',
           'product_name',
]

products_2 = products[columns_products]
h(products_2)

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [86]:
#merge orders and product df's

merged = pd.merge(order_products2,products_2, how='inner', on='product_id')
h(merged)

   order_id  product_id        product_name
0         2       33120  Organic Egg Whites
1        26       33120  Organic Egg Whites
2       120       33120  Organic Egg Whites
3       327       33120  Organic Egg Whites
4       390       33120  Organic Egg Whites

In [87]:
#top 10 ordered products and amount of times bought

merged["product_name"].value_counts().head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

# Replicating lesson code

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [89]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [90]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [91]:
#starting to create a tidy version of the table

table1 = table1.reset_index()
h(table1)

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [92]:
#using melt function to reshape table 1 into Tidy format    

tidy = table1.melt(id_vars="index",value_vars=["treatmenta","treatmentb"])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [93]:
tidy = tidy.rename(columns={
    'index': 'name', 
    'variable': 'trt', 
    'value': 'result'
})

tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [94]:
tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

# Tidy Exercises

In [95]:
#Performing Tidy Operation on Table 2

h(table2)

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [96]:
table2 = table2.reset_index()
h(table2)

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [109]:
value_columns = list(table2.columns[1:]) 
tidy = table2.melt(id_vars="index",value_vars=value_columns)
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [110]:
tidy = tidy.rename(columns={
    'index': 'trt', 
    'variable': 'name', 
    'value': 'result'
})

tidy

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [111]:
tidy.trt = tidy.trt.str.replace('treatment', '')

tidy

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [112]:
#performing pivot_table function on table2

table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [114]:
#pivot_table AKA original table 2 below. will need repitition. not intuitive yet. 

wide = tidy.pivot_table(index='trt', columns=["name"], values='result')
wide

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [0]:
#seaborn flights loading

flights = sns.load_dataset('flights')

In [118]:
h(flights)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [120]:
flights.shape

(144, 3)


Create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [123]:
#created pivot table revealing the correct results

passenger_pivot = flights.pivot_table(index="year",columns=["month"],values = "passengers")
h(passenger_pivot,100)

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [198]:
def csv(handle):
    file = handle
    handle = handle.strip(".csv")
    globals()[handle] = pd.read_csv(file)


csv("bank.csv")

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
5     35;"management";"single";"tertiary";"no";747;"...
6     36;"self-employed";"married";"tertiary";"no";3...
7     39;"technician";"married";"secondary";"no";147...
8     41;"entrepreneur";"married";"tertiary";"no";22...
9     43;"services";"married";"primary";"no";-88;"ye...
10    39;"services";"married";"secondary";"no";9374;...
11    43;"admin.";"married";"secondary";"no";264;"ye...
12    36;"technician";"married";"tertiary";"no";1109...
13    20;"student";"single";"secondary";"no";502;"no...
14    31;"blue-collar";"married";"secondary";"no";36...
15    40;"management";"married";"tertiary";"no";194;...
16    56;"technician";"married";"secondary";"no";407...
17    37;"admin.";"single";"tertiary";"no";2317;"yes...
18    25;"blue-collar";"single";"primary";"no";-221;...
19    31;"services";"married";"secondary";"no";132;"...
20    38;"management";"divorced";"unknown";"no";0;"y...
21    42;"management";"divorced";"tertiary";"no";16;...
22    44;"services";"single";"secondary";"no";106;"n...
23    44;"entrepreneur";"married";"secondary";"no";9...
24    26;"housemaid";"married";"tertiary";"no";543;"...
25    41;"management";"married";"tertiary";"no";5883...
26    55;"blue-collar";"married";"primary";"no";627;...
27    67;"retired";"married";"unknown";"no";696;"no"...
28    56;"self-employed";"married";"secondary";"no";...
29    53;"admin.";"married";"secondary";"no";105;"no...
...                                                 ...
4491  35;"blue-collar";"single";"secondary";"no";0;"...
4492  32;"technician";"single";"secondary";"no";309;...
4493  28;"technician";"single";"tertiary";"no";0;"ye...
4494  26;"technician";"single";"secondary";"no";668;...
4495  48;"management";"married";"tertiary";"no";1175...
4496  30;"blue-collar";"single";"secondary";"no";363...
4497  31;"entrepreneur";"single";"tertiary";"no";38;...
4498  31;"management";"married";"tertiary";"no";1183...
4499  45;"blue-collar";"divorced";"primary";"no";942...
4500  38;"admin.";"married";"secondary";"no";4196;"y...
4501  34;"management";"married";"tertiary";"no";297;...
4502  42;"services";"married";"secondary";"no";-91;"...
4503  60;"self-employed";"married";"primary";"no";36...
4504  42;"blue-collar";"single";"secondary";"no";108...
4505  32;"admin.";"single";"secondary";"no";620;"yes...
4506  42;"unemployed";"divorced";"tertiary";"no";-16...
4507  33;"services";"married";"secondary";"no";288;"...
4508  42;"admin.";"married";"unknown";"no";642;"yes"...
4509  51;"technician";"married";"tertiary";"no";2506...
4510  36;"technician";"divorced";"secondary";"no";56...
4511  46;"blue-collar";"married";"secondary";"no";66...
4512  40;"blue-collar";"married";"secondary";"no";11...
4513  49;"blue-collar";"married";"secondary";"no";32...
4514  38;"blue-collar";"married";"secondary";"no";12...
4515  32;"services";"single";"secondary";"no";473;"y...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####